espressif/esp-idf/components/soc/esp32h21/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_HP_APM_M2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_HP_APM_M2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x70)
/** INTMTX_CORE0_HP_APM_M2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_HP_APM_M2_INTR mapping register
 */
#define INTMTX_CORE0_HP_APM_M2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_HP_APM_M2_INTR_MAP_M  (INTMTX_CORE0_HP_APM_M2_INTR_MAP_V << INTMTX_CORE0_HP_APM_M2_INTR_MAP_S)
#define INTMTX_CORE0_HP_APM_M2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_HP_APM_M2_INTR_MAP_S  0

/** INTMTX_CORE0_HP_APM_M3_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_HP_APM_M3_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x74)
/** INTMTX_CORE0_HP_APM_M3_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_HP_APM_M3_INTR mapping register
 */
#define INTMTX_CORE0_HP_APM_M3_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_HP_APM_M3_INTR_MAP_M  (INTMTX_CORE0_HP_APM_M3_INTR_MAP_V << INTMTX_CORE0_HP_APM_M3_INTR_MAP_S)
#define INTMTX_CORE0_HP_APM_M3_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_HP_APM_M3_INTR_MAP_S  0

/** INTMTX_CORE0_MSPI_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_MSPI_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x78)
/** INTMTX_CORE0_MSPI_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_MSPI_INTR mapping register
 */
#define INTMTX_CORE0_MSPI_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_MSPI_INTR_MAP_M  (INTMTX_CORE0_MSPI_INTR_MAP_V << INTMTX_CORE0_MSPI_INTR_MAP_S)
#define INTMTX_CORE0_MSPI_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_MSPI_INTR_MAP_S  0

/** INTMTX_CORE0_I2S1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_I2S1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x7c)
/** INTMTX_CORE0_I2S1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_I2S1_INTR mapping register
 */
#define INTMTX_CORE0_I2S1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_I2S1_INTR_MAP_M  (INTMTX_CORE0_I2S1_INTR_MAP_V << INTMTX_CORE0_I2S1_INTR_MAP_S)
#define INTMTX_CORE0_I2S1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_I2S1_INTR_MAP_S  0

/** INTMTX_CORE0_UHCI0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_UHCI0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x80)
/** INTMTX_CORE0_UHCI0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_UHCI0_INTR mapping register
 */
#define INTMTX_CORE0_UHCI0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_UHCI0_INTR_MAP_M  (INTMTX_CORE0_UHCI0_INTR_MAP_V << INTMTX_CORE0_UHCI0_INTR_MAP_S)
#define INTMTX_CORE0_UHCI0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_UHCI0_INTR_MAP_S  0

/** INTMTX_CORE0_UART0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_UART0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x84)
/** INTMTX_CORE0_UART0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_UART0_INTR mapping register
 */
#define INTMTX_CORE0_UART0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_UART0_INTR_MAP_M  (INTMTX_CORE0_UART0_INTR_MAP_V << INTMTX_CORE0_UART0_INTR_MAP_S)
#define INTMTX_CORE0_UART0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_UART0_INTR_MAP_S  0

/** INTMTX_CORE0_UART1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_UART1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x88)
/** INTMTX_CORE0_UART1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_UART1_INTR mapping register
 */
#define INTMTX_CORE0_UART1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_UART1_INTR_MAP_M  (INTMTX_CORE0_UART1_INTR_MAP_V << INTMTX_CORE0_UART1_INTR_MAP_S)
#define INTMTX_CORE0_UART1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_UART1_INTR_MAP_S  0

/** INTMTX_CORE0_LEDC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LEDC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x8c)
/** INTMTX_CORE0_LEDC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LEDC_INTR mapping register
 */
#define INTMTX_CORE0_LEDC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LEDC_INTR_MAP_M  (INTMTX_CORE0_LEDC_INTR_MAP_V << INTMTX_CORE0_LEDC_INTR_MAP_S)
#define INTMTX_CORE0_LEDC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LEDC_INTR_MAP_S  0

/** INTMTX_CORE0_CAN0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CAN0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x90)
/** INTMTX_CORE0_CAN0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CAN0_INTR mapping register
 */
#define INTMTX_CORE0_CAN0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_CAN0_INTR_MAP_M  (INTMTX_CORE0_CAN0_INTR_MAP_V << INTMTX_CORE0_CAN0_INTR_MAP_S)
#define INTMTX_CORE0_CAN0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_CAN0_INTR_MAP_S  0

/** INTMTX_CORE0_USB_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_USB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x94)
/** INTMTX_CORE0_USB_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_USB_INTR mapping register
 */
#define INTMTX_CORE0_USB_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_USB_INTR_MAP_M  (INTMTX_CORE0_USB_INTR_MAP_V << INTMTX_CORE0_USB_INTR_MAP_S)
#define INTMTX_CORE0_USB_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_USB_INTR_MAP_S  0

/** INTMTX_CORE0_RMT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_RMT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x98)
/** INTMTX_CORE0_RMT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_RMT_INTR mapping register
 */
#define INTMTX_CORE0_RMT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_RMT_INTR_MAP_M  (INTMTX_CORE0_RMT_INTR_MAP_V << INTMTX_CORE0_RMT_INTR_MAP_S)
#define INTMTX_CORE0_RMT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_RMT_INTR_MAP_S  0

/** INTMTX_CORE0_I2C_EXT0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_I2C_EXT0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x9c)
/** INTMTX_CORE0_I2C_EXT0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_I2C_EXT0_INTR mapping register
 */
#define INTMTX_CORE0_I2C_EXT0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_I2C_EXT0_INTR_MAP_M  (INTMTX_CORE0_I2C_EXT0_INTR_MAP_V << INTMTX_CORE0_I2C_EXT0_INTR_MAP_S)
#define INTMTX_CORE0_I2C_EXT0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_I2C_EXT0_INTR_MAP_S  0

/** INTMTX_CORE0_I2C_EXT1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_I2C_EXT1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa0)
/** INTMTX_CORE0_I2C_EXT1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_I2C_EXT1_INTR mapping register
 */
#define INTMTX_CORE0_I2C_EXT1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_I2C_EXT1_INTR_MAP_M  (INTMTX_CORE0_I2C_EXT1_INTR_MAP_V << INTMTX_CORE0_I2C_EXT1_INTR_MAP_S)
#define INTMTX_CORE0_I2C_EXT1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_I2C_EXT1_INTR_MAP_S  0

