espressif/esp-idf/components/soc/esp32h21/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd4)
/** INTMTX_CORE0_DMA_IN_CH0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_IN_CH0_INTR mapping register
 */
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd8)
/** INTMTX_CORE0_DMA_IN_CH1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_IN_CH1_INTR mapping register
 */
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xdc)
/** INTMTX_CORE0_DMA_IN_CH2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_IN_CH2_INTR mapping register
 */
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_M  (INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_V << INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_S)
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe0)
/** INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_OUT_CH0_INTR mapping register
 */
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe4)
/** INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_OUT_CH1_INTR mapping register
 */
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_S  0

/** INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe8)
/** INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_DMA_OUT_CH2_INTR mapping register
 */
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_M  (INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_V << INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_S)
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_S  0

/** INTMTX_CORE0_GPSPI2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_GPSPI2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xec)
/** INTMTX_CORE0_GPSPI2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_GPSPI2_INTR mapping register
 */
#define INTMTX_CORE0_GPSPI2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_GPSPI2_INTR_MAP_M  (INTMTX_CORE0_GPSPI2_INTR_MAP_V << INTMTX_CORE0_GPSPI2_INTR_MAP_S)
#define INTMTX_CORE0_GPSPI2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_GPSPI2_INTR_MAP_S  0

/** INTMTX_CORE0_AES_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_AES_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf0)
/** INTMTX_CORE0_AES_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_AES_INTR mapping register
 */
#define INTMTX_CORE0_AES_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_AES_INTR_MAP_M  (INTMTX_CORE0_AES_INTR_MAP_V << INTMTX_CORE0_AES_INTR_MAP_S)
#define INTMTX_CORE0_AES_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_AES_INTR_MAP_S  0

/** INTMTX_CORE0_SHA_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SHA_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf4)
/** INTMTX_CORE0_SHA_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_SHA_INTR mapping register
 */
#define INTMTX_CORE0_SHA_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SHA_INTR_MAP_M  (INTMTX_CORE0_SHA_INTR_MAP_V << INTMTX_CORE0_SHA_INTR_MAP_S)
#define INTMTX_CORE0_SHA_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SHA_INTR_MAP_S  0

/** INTMTX_CORE0_RSA_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_RSA_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xf8)
/** INTMTX_CORE0_RSA_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_RSA_INTR mapping register
 */
#define INTMTX_CORE0_RSA_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_RSA_INTR_MAP_M  (INTMTX_CORE0_RSA_INTR_MAP_V << INTMTX_CORE0_RSA_INTR_MAP_S)
#define INTMTX_CORE0_RSA_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_RSA_INTR_MAP_S  0

/** INTMTX_CORE0_ECC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ECC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xfc)
/** INTMTX_CORE0_ECC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_ECC_INTR mapping register
 */
#define INTMTX_CORE0_ECC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ECC_INTR_MAP_M  (INTMTX_CORE0_ECC_INTR_MAP_V << INTMTX_CORE0_ECC_INTR_MAP_S)
#define INTMTX_CORE0_ECC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ECC_INTR_MAP_S  0

/** INTMTX_CORE0_ECDSA_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ECDSA_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x100)
/** INTMTX_CORE0_ECDSA_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_ECDSA_INTR mapping register
 */
#define INTMTX_CORE0_ECDSA_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ECDSA_INTR_MAP_M  (INTMTX_CORE0_ECDSA_INTR_MAP_V << INTMTX_CORE0_ECDSA_INTR_MAP_S)
#define INTMTX_CORE0_ECDSA_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ECDSA_INTR_MAP_S  0

/** INTMTX_CORE0_INT_STATUS_REG_0_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_0_REG (DR_REG_INTMTX_BASE + 0x104)
/** INTMTX_CORE0_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Status register for interrupt sources 0~31 mapping register
 */
#define INTMTX_CORE0_INT_STATUS_0    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_0_M  (INTMTX_CORE0_INT_STATUS_0_V << INTMTX_CORE0_INT_STATUS_0_S)
#define INTMTX_CORE0_INT_STATUS_0_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_0_S  0

/** INTMTX_CORE0_INT_STATUS_REG_1_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_1_REG (DR_REG_INTMTX_BASE + 0x108)
/** INTMTX_CORE0_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Status register for interrupt sources 32~63 mapping register
 */
#define INTMTX_CORE0_INT_STATUS_1    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_1_M  (INTMTX_CORE0_INT_STATUS_1_V << INTMTX_CORE0_INT_STATUS_1_S)
#define INTMTX_CORE0_INT_STATUS_1_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_1_S  0

